// Практика 5.1
// Настройте тестовое окружение JEST.

let num_1 = 1;
let num_2 = 2;

function add_numb(obj_1, obj_2) {
    result = obj_1 + obj_2;
    return result;
}

let res = add_numb(num_1, num_2);
console.log(res)

module.exports = add_numb;





// Практика 6.1
// Реализуйте и протестируйте функцию (проведите хотя бы один тест).

// Напишите функцию, которая принимает строку и возвращает эту строку в перевёрнутом виде (например, “строка” — “акортс”).

// Ответы для самопроверки:

// Реализация

// Тест













// Практика 6.2
// Выберите любую реализованную функцию из тренажера JavaScript, раздел «Функции» и:

// добавьте её в репозиторий, который вы создали для выполнения практики в юните 5;
// продумайте тест-кейсы (успешное/неуспешное выполнение функции);
// продумайте граничные случаи (corner case); 
// напишите юнит-тесты (минимум три).
// Удачи!

// Убедитесь, что в вашем репозитории созданы папки с соответствующими названиями для практики 
// из юнитов 5 и 6 и в них добавлены необходимые файлы с решениями.
// Вставьте в форму ниже ссылку на ваш репозиторий.
 

// Проверка решения через GitHub позволит ментору внести корректировки и отправить коммит 
// (новую версию документа). В ней сразу будет видно, что поменялось по сравнению с предыдущим 
// вариантом. Кроме этого, эксперт сможет оставить свои комментарии.
// Ваш репозиторий НЕ должен быть приватным, чтобы ментор мог проверить вашу работу.